import math


def area(r):
    '''
    Принимает радиус r, возвращает площадь круга.

        Параметры: 
	    r (int or float): радиус круга.

        Возвращаемое значение:
	    math.pi * r * r (float): площадь круга.
    '''

    return math.pi * r * r


def perimeter(r):
    '''
    Принимает радиус r, возвращает длину окружности (периметр).

    Параметры:
        r (int or float): радиус круга.

    Возвращаемое значение:
        2 * math.pi * r (float): длина окружности.
    '''

    return 2 * math.pi * r

