import math

def area(r):
    '''
    Принимает радиус r, возвращает площадь круга.

        Параметры:
            r (int or float): радиус круга.

        Возвращаемое значение:
            math.pi * r * r (float): площадь круга.

        Пример вызова:
            area(3) -> 28.274333882308138
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Принимает радиус r, возвращает длину окружности (периметр).

        Параметры:
            r (int or float): радиус круга.

        Возвращаемое значение:
            2 * math.pi * r (float): длина окружности.

        Пример вызова:
            perimeter(3) -> 18.84955592153876
    '''
    return 2 * math.pi * r


