def area(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его площадь.

    Параметры:
        a (int or float): первая сторона прямоугольника.
        b (int or float): вторая сторона прямоугольника.

    Возвращаемое значение:
        a * b (int or float): площадь прямоугольника.
    '''

    return a * b

def perimeter(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его периметр.

    Параметры:
        a (int or float): первая сторона прямоугольника.
        b (int or float): вторая сторона прямоугольника.

    Возвращаемое значение:
        2 * (a + b) (int or float): периметр прямоугольника.
    '''

    return 2 * (a + b)
