def area(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его площадь.

        Параметры:
            a: первая сторона прямоугольника.
            b: вторая сторона прямоугольника.

        Возвращаемое значение:
            a * b: площадь прямоугольника.

        Пример вызова:
            area(4, 6) -> 24
    '''
    return a * b


def perimeter(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его периметр.

        Параметры:
            a: первая сторона прямоугольника.
            b: вторая сторона прямоугольника.

        Возвращаемое значение:
            2 * (a + b): периметр прямоугольника.

        Пример вызова:
            perimeter(4, 6) -> 20
    '''
    return 2 * (a + b)

