def area(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его площадь.

        Параметры:
            a (int or float): первая сторона прямоугольника.
            b (int or float): вторая сторона прямоугольника.

        Возвращаемое значение:
            a * b (int or float): площадь прямоугольника.

        Пример вызова:
            area(4, 6) -> 24
    '''
    return a * b


def perimeter(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его периметр.

        Параметры:
            a (int or float): первая сторона прямоугольника.
            b (int or float): вторая сторона прямоугольника.

        Возвращаемое значение:
            2 * (a + b) (int or float): периметр прямоугольника.

        Пример вызова:
            perimeter(4, 6) -> 20
    '''
    return 2 * (a + b)

