
def area(a):
    '''
    Принимает сторону квадрата a, возвращает площадь квадрата.

        Параметры:
            a (int or float): сторона квадрата.

        Возвращаемое значение:
            a * a (int or float): площадь квадрата.
    '''
    return a * a


def perimeter(a):
    '''
    Принимает сторону квадрата a, возвращает периметр квадрата.

        Параметры:
            a (int or float): сторона квадрата.

        Возвращаемое значение:
            4 * a (int or float): периметр квадрата.
    '''
    return 4 * a
