def area(a, h):
    '''
    Принимает сторону a и высоту h, возвращает площадь треугольника.

        Параметры:
            a: основание треугольника.
            h: высота треугольника.

        Возвращаемое значение:
            a * h / 2: площадь треугольника.

        Пример вызова:
            area(4, 5) -> 10.0
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Принимает три стороны a, b, c, возвращает периметр треугольника.

        Параметры:
            a: первая сторона треугольника.
            b: вторая сторона треугольника.
            c: третья сторона треугольника.

        Возвращаемое значение:
            a + b + c: периметр треугольника.

        Пример вызова:
            perimeter(3, 4, 5) -> 12
    '''
    return a + b + c


