def area(a,h):
    '''
    Принимает сторону a и высоту h, возвращает площадь треугольника.

        Параметры:
            a (int or float): основание треугольника.
            h (int or float): высота треугольника.

        Возвращаемое значение:
            a * h / 2 (float): площадь треугольника.
    '''
    return a*h / 2
def perimeter(a, b, c):
    '''
    Принимает три стороны a, b, c, возвращает периметр треугольника.

        Параметры:
            a (int or float): первая сторона треугольника.
            b (int or float): вторая сторона треугольника.
            c (int or float): третья сторона треугольника.

        Возвращаемое значение:
            a + b + c (int or float): периметр треугольника.
    '''
    return a+b+c
